tutorials/immersedBoundary/MovingIb/Turbulent/kEpsilon/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p|pFinal|pcorr"
    {
        solver           GAMG;
        smoother         DICGaussSeidel;
        tolerance        1e-6;
        relTol           0.01;
        smoother        GaussSeidel;
        cacheAgglomeration off;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        preconditioner  DIC;
    }
    "U|UFinal|k|epsilon|omega|omegaFinal|kFinal|epsilonFinal"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    pRefPoint (0 -0.45 0.05);
    pRefValue 0;
}

PIMPLE
{
    nOuterCorrectors 4;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;

    pRefPoint (0 -0.45 0.05);
    pRefValue 0;
    checkMeshCourantNo no;
    correctPhi yes;
}

PISO
{
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    equations
    {
        U         1;
        UFinal    1;
    }
    fields
    {
    }
}


// ************************************************************************* //
